lib/tasks/reddits.rake

INSERT INTO "reddits" ("topic", "subreddit", "link", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["topic", "Gifs"], ["subreddit", "/r/gifs"], ["link", "https://www.reddit.com/r/gifs"], ["created_at", "2024-03-21 19:18:50.791979"], ["updated_at", "2024-03-21 19:18:50.791979"]]
---
  task :parse, [:file_name] => :environment do
    main_link = "https://www.reddit.com"
    url = "https://www.reddit.com/r/ListOfSubreddits/wiki/listofsubreddits"

    html = URI.open(url)
    doc = Nokogiri::HTML(html)

    doc.css("div.md.wiki").each do |div|
      div.css("h1, h2, h3, h4").each do |header|
        next if header["id"] == "wiki_general_content"

        topic = header.text.strip
        paragraph = header.xpath("following-sibling::p").first

        next unless paragraph

        paragraph.css("a").each do |link|
          title = link.text.strip
          url = main_link + link["href"]

          Reddit.create(topic:, subreddit: title, link: url)