app/views/topics/index.html.erb

      <small class="text-muted">
        (Posts: <%= topic.posts.count %>)
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."topic_id" = $1  [["topic_id", 1]]