app/views/posts/_form.html.erb

SELECT "topics".* FROM "topics"
---
          <%= form.label :topic_id, I18n.t("topic"), class: "control-label" %>
          <%= form.collection_select :topic_id, Topic.all, :id, :name, { prompt: I18n.t("select_a_topic") }, class: "form-control" %>