app/controllers/home_controller.rb

SELECT "reddits".* FROM "reddits" ORDER BY "reddits"."topic" ASC LIMIT $1 OFFSET $2  [["LIMIT", 50], ["OFFSET", 0]]
SELECT COUNT(*) FROM "reddits"
---
  def index
    @reddits = Reddit.order(:topic).page params[:page]