app/controllers/home_controller.rb

  def index
    @reddits = Reddit.all
---
SELECT "reddits".* FROM "reddits"