app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."likes" DESC, "posts"."dislikes" ASC
---
  def index
    @posts = Post.order(likes: :desc, dislikes: :asc)

INSERT INTO "posts" ("img_link", "title", "body", "replies", "likes", "dislikes", "topic_id", "created_at", "updated_at", "is_hidden") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @post = Post.new(post_params)
    @post.replies = 0
    @post.likes = 0
    @post.dislikes = 0

    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "likes" = COALESCE("likes", 0) + $1 WHERE "posts"."id" = $2  [["likes", 1], ["id", 1]]
---
  def like
    @post = Post.find(params[:id])
    @post.increment!(:likes)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "dislikes" = COALESCE("dislikes", 0) + $1 WHERE "posts"."id" = $2  [["dislikes", 1], ["id", 1]]
---
  def dislike
    @post = Post.find(params[:id])
    @post.increment!(:dislikes)