app/controllers/topics_controller.rb

  def create
    @topic = Topic.new(topic_params)

    respond_to do |format|
      if @topic.save
---
INSERT INTO "topics" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Title1"], ["description", "Description1"], ["created_at", "2024-03-13 19:26:17.948428"], ["updated_at", "2024-03-13 19:26:17.948428"]]

  def set_topic
    @topic = Topic.find(params[:id])
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]